# Используем официальный стабильный образ Python (без использования mise)
FROM python:3.12-slim

# Указываем рабочую директорию в контейнере
WORKDIR /app

# Копируем файл со списком зависимостей
COPY requirements.txt .

# Устанавливаем библиотеки вашего проекта
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код проекта в контейнер
COPY . .

# Команда для запуска. 
# ЗАМЕНИТЕ "main.py" на название вашего главного файла (например, bot.py, app.py)
CMD ["python", "raider.py"]
